import React from 'react'

const subjects = [
        { title:"دانشگاهی و تخصصی", value: ["نگارش آکادمیک","مهندسی برق", "مهندسی مکانیک", "مهندسی عمران","تحقیق در عملیات","مهندسی کامپیوتر","آمار و احتمالات", "علوم اقتصادی", "موارد بیشتر..." ]},
        { title:"برنامه‌نویسی", value: ["نگارش آکادمیک","مهندسی برق", "مهندسی مکانیک", "مهندسی عمران","تحقیق در عملیات","مهندسی کامپیوتر","آمار و احتمالات", "علوم اقتصادی", "موارد بیشتر..." ]},
        { title:"یادگیری ماشین", value: ["نگارش آکادمیک","مهندسی برق", "مهندسی مکانیک", "مهندسی عمران","تحقیق در عملیات","مهندسی کامپیوتر","آمار و احتمالات", "علوم اقتصادی", "موارد بیشتر..." ]},
        { title:"نرم افزارهای کاربردی", value: ["نگارش آکادمیک","مهندسی برق", "مهندسی مکانیک", "مهندسی عمران","تحقیق در عملیات","مهندسی کامپیوتر","آمار و احتمالات", "علوم اقتصادی", "موارد بیشتر..." ]},
        { title:"مباحث مشترک و عمومی", value: ["نگارش آکادمیک","مهندسی برق", "مهندسی مکانیک", "مهندسی عمران","تحقیق در عملیات","مهندسی کامپیوتر","آمار و احتمالات", "علوم اقتصادی", "موارد بیشتر..." ]},
]


const Subjects = () => {
  return (
      <div className='w-full flex justify-evenly px-[60px] py-[30px] border-t' >
          {
              subjects.map((item, idx) => 
                  <div className='' key={idx} >
                  <p className=' mt-3 mb-4 font-semibold text-[0.95rem]'>{item.title}</p>
                  <ul className='flex flex-col'>
                    {
                      item.value.map((sbj, subIdx) => <li key={subIdx} className='font-light mb-2 cursor-pointer text-[#4c555d] hover:text-[#202325]'>{ sbj }</li> )
                    }
                  </ul>
                  </div>
                  
              )
          }
    </div>
  )
}

export default Subjects